apache/nuttx/arch/arm/src/stm32g4/hardware/stm32g4xxxx_pwr.h
/****************************************************************************
 * arch/arm/src/stm32g4/hardware/stm32g4xxxx_pwr.h
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 *  Licensed to the Apache Software Foundation (ASF) under one or more
 *  contributor license agreements.  See the NOTICE file distributed with
 *  this work for additional information regarding copyright ownership.  The
 *  ASF licenses this file to you under the Apache License, Version 2.0 (the
 *  "License"); you may not use this file except in compliance with the
 *  License.  You may obtain a copy of the License at
 *
 *    http://www.apache.org/licenses/LICENSE-2.0
 *
 *  Unless required by applicable law or agreed to in writing, software
 *  distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 *  WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 *  License for the specific language governing permissions and limitations
 *  under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_STM32_HARDWARE_STM32G4XXXX_PWR_H
#define __ARCH_ARM_SRC_STM32_HARDWARE_STM32G4XXXX_PWR_H

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Register Offsets *********************************************************/

#define STM32_PWR_CR1_OFFSET           0x0000        /* PWR Power Control Register 1 */
#define STM32_PWR_CR2_OFFSET           0x0004        /* PWR Power Control Register 2 */
#define STM32_PWR_CR3_OFFSET           0x0008        /* PWR Power Control Register 3 */
#define STM32_PWR_CR4_OFFSET           0x000c        /* PWR Power Control Register 4 */
#define STM32_PWR_SR1_OFFSET           0x0010        /* PWR Power Status Register 1 */
#define STM32_PWR_SR2_OFFSET           0x0014        /* PWR Power Status Register 2 */
#define STM32_PWR_SCR_OFFSET           0x0018        /* PWR Power Status Reset Register */
                                                     /* Offset 0x001c Reserved */
#define STM32_PWR_PUCRA_OFFSET         0x0020        /* Power Port A Pull Up Control Register */
#define STM32_PWR_PDCRA_OFFSET         0x0024        /* Power Port A Pull Down Control Register */
#define STM32_PWR_PUCRB_OFFSET         0x0028        /* Power Port B Pull Up Control Register */
#define STM32_PWR_PDCRB_OFFSET         0x002c        /* Power Port B Pull Down Control Register */
#define STM32_PWR_PUCRC_OFFSET         0x0030        /* Power Port C Pull Up Control Register */
#define STM32_PWR_PDCRC_OFFSET         0x0034        /* Power Port C Pull Down Control Register */
#define STM32_PWR_PUCRD_OFFSET         0x0038        /* Power Port D Pull Up Control Register */
#define STM32_PWR_PDCRD_OFFSET         0x003c        /* Power Port D Pull Down Control Register */
#define STM32_PWR_PUCRE_OFFSET         0x0040        /* Power Port E Pull Up Control Register */
#define STM32_PWR_PDCRE_OFFSET         0x0044        /* Power Port E Pull Down Control Register */
#define STM32_PWR_PUCRF_OFFSET         0x0048        /* Power Port F Pull Up Control Register */
#define STM32_PWR_PDCRF_OFFSET         0x004c        /* Power Port F Pull Down Control Register */
#define STM32_PWR_PUCRG_OFFSET         0x0050        /* Power Port G Pull Up Control Register */
#define STM32_PWR_PDCRG_OFFSET         0x0054        /* Power Port G Pull Down Control Register */
                                                     /* Offset 0x0058 Reserved */
                                                     /* Offset 0x005C Reserved */
                                                     /* Offset 0x0060 Reserved */
                                                     /* Offset 0x0064 Reserved */
                                                     /* Offset 0x0068 Reserved */
                                                     /* Offset 0x006C Reserved */
                                                     /* Offset 0x0070 Reserved */
                                                     /* Offset 0x0074 Reserved */
                                                     /* Offset 0x0078 Reserved */
                                                     /* Offset 0x007C Reserved */
#define STM32_PWR_CR5_OFFSET           0x0080        /* PWR Power Control Register 5 */

/* Register Addresses *******************************************************/

#define STM32_PWR_CR1                  (STM32_PWR_BASE + STM32_PWR_CR1_OFFSET)
#define STM32_PWR_CR2                  (STM32_PWR_BASE + STM32_PWR_CR2_OFFSET)
#define STM32_PWR_CR3                  (STM32_PWR_BASE + STM32_PWR_CR3_OFFSET)
#define STM32_PWR_CR4                  (STM32_PWR_BASE + STM32_PWR_CR4_OFFSET)
#define STM32_PWR_SR1                  (STM32_PWR_BASE + STM32_PWR_SR1_OFFSET)
#define STM32_PWR_SR2                  (STM32_PWR_BASE + STM32_PWR_SR2_OFFSET)
#define STM32_PWR_SCR                  (STM32_PWR_BASE + STM32_PWR_SCR_OFFSET)
#define STM32_PWR_PUCRA                (STM32_PWR_BASE + STM32_PWR_PUCRA_OFFSET)
#define STM32_PWR_PDCRA                (STM32_PWR_BASE + STM32_PWR_PDCRA_OFFSET)
#define STM32_PWR_PUCRB                (STM32_PWR_BASE + STM32_PWR_PUCRB_OFFSET)
#define STM32_PWR_PDCRB                (STM32_PWR_BASE + STM32_PWR_PDCRB_OFFSET)
#define STM32_PWR_PUCRC                (STM32_PWR_BASE + STM32_PWR_PUCRC_OFFSET)
#define STM32_PWR_PDCRC                (STM32_PWR_BASE + STM32_PWR_PDCRC_OFFSET)
#define STM32_PWR_PUCRD                (STM32_PWR_BASE + STM32_PWR_PUCRD_OFFSET)
#define STM32_PWR_PDCRD                (STM32_PWR_BASE + STM32_PWR_PDCRD_OFFSET)
#define STM32_PWR_PUCRE                (STM32_PWR_BASE + STM32_PWR_PUCRE_OFFSET)
#define STM32_PWR_PDCRE                (STM32_PWR_BASE + STM32_PWR_PDCRE_OFFSET)
#define STM32_PWR_PUCRF                (STM32_PWR_BASE + STM32_PWR_PUCRF_OFFSET)
#define STM32_PWR_PDCRF                (STM32_PWR_BASE + STM32_PWR_PDCRF_OFFSET)
#define STM32_PWR_PUCRG                (STM32_PWR_BASE + STM32_PWR_PUCRG_OFFSET)
#define STM32_PWR_PDCRG                (STM32_PWR_BASE + STM32_PWR_PDCRG_OFFSET)
#define STM32_PWR_CR5                  (STM32_PWR_BASE + STM32_PWR_CR5_OFFSET)

/* Register Bitfield Definitions ********************************************/

/* PWR Power Control Register 1 (CR1) */

#define PWR_CR1_LPR_SHIFT              (14)                               /* Low Power Run */
#define PWR_CR1_LPR                    (0x1 << PWR_CR1_LPR_SHIFT)
#define PWR_CR1_VOS_SHIFT              (9)                                /* Voltage Scaling Range Selection */
#define PWR_CR1_VOS_MASK               (0x3 << PWR_CR1_VOS_SHIFT)
#  define PWR_CR1_VOS_RANGE_1          (0x1 << PWR_CR1_VOS_SHIFT)
#  define PWR_CR1_VOS_RANGE_2          (0x2 << PWR_CR1_VOS_SHIFT)
#define PWR_CR1_DBP_SHIFT              (8)                                /* Disable Backup Domain Write Protection */
#define PWR_CR1_DBP                    (0x1 << PWR_CR1_DBP_SHIFT)
#define PWR_CR1_LPMS_SHIFT             (0)                                /* Low Power Mode Selection */
#define PWR_CR1_LPMS_MASK              (0x7 << PWR_CR1_LPMS_SHIFT)
#  define PWR_CR1_LPMS_STOP_0          (0x0 << PWR_CR1_LPMS_SHIFT)        /* Stop 0 Mode */
#  define PWR_CR1_LPMS_STOP_1          (0x1 << PWR_CR1_LPMS_SHIFT)        /* Stop 1 Mode */
#  define PWR_CR1_LPMS_STANDBY         (0x3 << PWR_CR1_LPMS_SHIFT)        /* Standby Mode */
#  define PWR_CR1_LPMS_SHUTDOWN        (0x4 << PWR_CR1_LPMS_SHIFT)        /* Shutdown Mode */

/* PWR Power Control Register 2 (CR2) */

#define PWR_CR2_PVDE                   (1 << 0)                           /* Power Voltage Detector Enable */
#define PWR_CR2_PLS_SHIFT              (1)                                /* Power Voltage Detector Level Selection */
#define PWR_CR2_PLS_MASK               (0x7 << PWR_CR2_PLS_SHIFT)
#  define PWR_CR2_PLS_0                (0x0 << PWR_CR2_PLS_SHIFT)
#  define PWR_CR2_PLS_1                (0x1 << PWR_CR2_PLS_SHIFT)
#  define PWR_CR2_PLS_2                (0x2 << PWR_CR2_PLS_SHIFT)
#  define PWR_CR2_PLS_3                (0x3 << PWR_CR2_PLS_SHIFT)
#  define PWR_CR2_PLS_4                (0x4 << PWR_CR2_PLS_SHIFT)
#  define PWR_CR2_PLS_5                (0x5 << PWR_CR2_PLS_SHIFT)
#  define PWR_CR2_PLS_6                (0x6 << PWR_CR2_PLS_SHIFT)
#  define PWR_CR2_PLS_7                (0x7 << PWR_CR2_PLS_SHIFT)
#define PWR_CR2_PVMEN1                 (1 << 6)                           /* Peripheral Voltage Monitoring 3 Enable (VDDA vs ADC or COMP Minimum Voltage) */
#define PWR_CR2_PVMEN2                 (1 << 7)                           /* Peripheral Voltage Monitoring 4 Enable (VDDA vs DAC 1Msps or 15Msps Minimum Voltage) */

