apache/nuttx/arch/arm/src/stm32g4/hardware/stm32g4xxxx_pwr.h
/* PWR Power Control Register 3 (CR3) */

#define PWR_CR3_EWUP1                  (1 << 0)                           /* Enable Wake Up Pin WKUP1 */
#define PWR_CR3_EWUP2                  (1 << 1)                           /* Enable Wake Up Pin WKUP2 */
#define PWR_CR3_EWUP3                  (1 << 2)                           /* Enable Wake Up Pin WKUP3 */
#define PWR_CR3_EWUP4                  (1 << 3)                           /* Enable Wake Up Pin WKUP4 */
#define PWR_CR3_EWUP5                  (1 << 4)                           /* Enable Wake Up Pin WKUP5 */
#define PWR_CR3_RRS                    (1 << 8)                           /* SRAM2 Retention In Standby Mode */
#define PWR_CR3_APC                    (1 << 10)                          /* Apply Pull Up And Pull Down Configuration */
#define PWR_CR3_UCPD1_STDBY            (1 << 13)                          /* USB Type C And Power Delivery Standby Mode */
#define PWR_CR3_UCPD1_DBDIS            (1 << 14)                          /* USB Type C And Power Delivery Dead Battery Disable */
#define PWR_CR3_EIWUL                  (1 << 15)                          /* Enable Internal Wake Up Line */

/* PWR Power Control Register 4 (CR4) */

#define PWR_CR4_WP1                    (1 << 0)                           /* Wake Up Pin WKUP1 polarity */
#define PWR_CR4_WP2                    (1 << 1)                           /* Wake Up Pin WKUP2 polarity */
#define PWR_CR4_WP3                    (1 << 2)                           /* Wake Up Pin WKUP3 polarity */
#define PWR_CR4_WP4                    (1 << 3)                           /* Wake Up Pin WKUP4 polarity */
#define PWR_CR4_WP5                    (1 << 4)                           /* Wake Up Pin WKUP5 polarity */
#define PWR_CR4_VBE                    (1 << 8)                           /* VBAT Battery charging Enable  */
#define PWR_CR4_VBRS                   (1 << 9)                           /* VBAT Battery charging Resistor Selection */

/* PWR Power Status Register 1 (SR1) */

#define PWR_SR1_WUF_SHIFT              (0)                                /* Wake Up Flags */
#define PWR_SR1_WUF_MASK               (0x1f << PWR_SR1_WUF_SHIFT)
#  define PWR_SR1_WUF1                 (0x1 << PWR_SR1_WUF_SHIFT)         /* Wake Up Flag 1 */
#  define PWR_SR1_WUF2                 (0x2 << PWR_SR1_WUF_SHIFT)         /* Wake Up Flag 2 */
#  define PWR_SR1_WUF3                 (0x4 << PWR_SR1_WUF_SHIFT)         /* Wake Up Flag 3 */
#  define PWR_SR1_WUF4                 (0x8 << PWR_SR1_WUF_SHIFT)         /* Wake Up Flag 4 */
#  define PWR_SR1_WUF5                 (0x10 << PWR_SR1_WUF_SHIFT)        /* Wake Up Flag 5 */
#define PWR_SR1_SBF                    (1 << 8)                           /* Stand-By Flag */
#define PWR_SR1_WUFI                   (1 << 15)                          /* Wake Up Flag Internal */

/* PWR Power Status Register 2 (SR2) */

#define PWR_SR2_FLASHRDY               (1 << 7)                           /* Flash Ready Flag */
#define PWR_SR2_REGLPS                 (1 << 8)                           /* Low-power Regulator Started */
#define PWR_SR2_REGLPF                 (1 << 9)                           /* Low-power Regulator Flag */
#define PWR_SR2_VOSF                   (1 << 10)                          /* Voltage Scaling Flag */
#define PWR_SR2_PVDO                   (1 << 11)                          /* Power Voltage Detector Output */
#define PWR_SR2_PVMO1                  (1 << 12)                          /* Peripheral Voltage Monitoring Output 1 */
#define PWR_SR2_PVMO2                  (1 << 13)                          /* Peripheral Voltage Monitoring Output 2 */
#define PWR_SR2_PVMO3                  (1 << 14)                          /* Peripheral Voltage Monitoring Output 3 */
#define PWR_SR2_PVMO4                  (1 << 15)                          /* Peripheral Voltage Monitoring Output 4 */

/* PWR Power Status Reset Register (SCR) */

#define PWR_SCR_CWUF_SHIFT             (0)                                /* Clear Wake Up Flags */
#define PWR_SCR_CWUF                   (0x1f << PWR_SCR_CWUF_SHIFT)
#  define PWR_SCR_CWUF1                (0x1 << PWR_SCR_CWUF_SHIFT)        /* Clear Wake Up Flag 1 */
#  define PWR_SCR_CWUF2                (0x2 << PWR_SCR_CWUF_SHIFT)        /* Clear Wake Up Flag 2 */
#  define PWR_SCR_CWUF3                (0x4 << PWR_SCR_CWUF_SHIFT)        /* Clear Wake Up Flag 3 */
#  define PWR_SCR_CWUF4                (0x8 << PWR_SCR_CWUF_SHIFT)        /* Clear Wake Up Flag 4 */
#  define PWR_SCR_CWUF5                (0x10 << PWR_SCR_CWUF_SHIFT)       /* Clear Wake Up Flag 5 */
#define PWR_SCR_CSBF                   (1 << 8)                           /* Clear Standby Flag */

/* Power Port A Pull Up Control Register (PUCRA) */

#define PWR_PUCRA_PA0                  (1 << 0)                           /* PA0 Pull Up Control Bit */
#define PWR_PUCRA_PA1                  (1 << 1)                           /* PA1 Pull Up Control Bit */
#define PWR_PUCRA_PA2                  (1 << 2)                           /* PA2 Pull Up Control Bit */
#define PWR_PUCRA_PA3                  (1 << 3)                           /* PA3 Pull Up Control Bit */
#define PWR_PUCRA_PA4                  (1 << 4)                           /* PA4 Pull Up Control Bit */
#define PWR_PUCRA_PA5                  (1 << 5)                           /* PA5 Pull Up Control Bit */
#define PWR_PUCRA_PA6                  (1 << 6)                           /* PA6 Pull Up Control Bit */
#define PWR_PUCRA_PA7                  (1 << 7)                           /* PA7 Pull Up Control Bit */
#define PWR_PUCRA_PA8                  (1 << 8)                           /* PA8 Pull Up Control Bit */
#define PWR_PUCRA_PA9                  (1 << 9)                           /* PA9 Pull Up Control Bit */
#define PWR_PUCRA_PA10                 (1 << 10)                          /* PA10 Pull Up Control Bit */
#define PWR_PUCRA_PA11                 (1 << 11)                          /* PA11 Pull Up Control Bit */
#define PWR_PUCRA_PA12                 (1 << 12)                          /* PA12 Pull Up Control Bit */
#define PWR_PUCRA_PA13                 (1 << 13)                          /* PA13 Pull Up Control Bit */
#define PWR_PUCRA_PA14                 (1 << 14)                          /* PA14 Pull Up Control Bit */
#define PWR_PUCRA_PA15                 (1 << 15)                          /* PA15 Pull Up Control Bit */

/* Power Port A Pull Down Control Register (PDCRA) */

