apache/nuttx/arch/arm/src/stm32g4/hardware/stm32g4xxxx_pwr.h
#define PWR_PDCRA_PA0                  (1 << 0)                           /* PA0 Pull Down Control Bit */
#define PWR_PDCRA_PA1                  (1 << 1)                           /* PA1 Pull Down Control Bit */
#define PWR_PDCRA_PA2                  (1 << 2)                           /* PA2 Pull Down Control Bit */
#define PWR_PDCRA_PA3                  (1 << 3)                           /* PA3 Pull Down Control Bit */
#define PWR_PDCRA_PA4                  (1 << 4)                           /* PA4 Pull Down Control Bit */
#define PWR_PDCRA_PA5                  (1 << 5)                           /* PA5 Pull Down Control Bit */
#define PWR_PDCRA_PA6                  (1 << 6)                           /* PA6 Pull Down Control Bit */
#define PWR_PDCRA_PA7                  (1 << 7)                           /* PA7 Pull Down Control Bit */
#define PWR_PDCRA_PA8                  (1 << 8)                           /* PA8 Pull Down Control Bit */
#define PWR_PDCRA_PA9                  (1 << 9)                           /* PA9 Pull Down Control Bit */
#define PWR_PDCRA_PA10                 (1 << 10)                          /* PA10 Pull Down Control Bit */
#define PWR_PDCRA_PA11                 (1 << 11)                          /* PA11 Pull Down Control Bit */
#define PWR_PDCRA_PA12                 (1 << 12)                          /* PA12 Pull Down Control Bit */
#define PWR_PDCRA_PA13                 (1 << 13)                          /* PA13 Pull Down Control Bit */
#define PWR_PDCRA_PA14                 (1 << 14)                          /* PA14 Pull Down Control Bit */
#define PWR_PDCRA_PA15                 (1 << 15)                          /* PA15 Pull Down Control Bit */

/* Power Port B Pull Up Control Register (PUCRB) */

#define PWR_PUCRB_PB0                  (1 << 0)                           /* PB0 Pull Up Control Bit */
#define PWR_PUCRB_PB1                  (1 << 1)                           /* PB1 Pull Up Control Bit */
#define PWR_PUCRB_PB2                  (1 << 2)                           /* PB2 Pull Up Control Bit */
#define PWR_PUCRB_PB3                  (1 << 3)                           /* PB3 Pull Up Control Bit */
#define PWR_PUCRB_PB4                  (1 << 4)                           /* PB4 Pull Up Control Bit */
#define PWR_PUCRB_PB5                  (1 << 5)                           /* PB5 Pull Up Control Bit */
#define PWR_PUCRB_PB6                  (1 << 6)                           /* PB6 Pull Up Control Bit */
#define PWR_PUCRB_PB7                  (1 << 7)                           /* PB7 Pull Up Control Bit */
#define PWR_PUCRB_PB8                  (1 << 8)                           /* PB8 Pull Up Control Bit */
#define PWR_PUCRB_PB9                  (1 << 9)                           /* PB9 Pull Up Control Bit */
#define PWR_PUCRB_PB10                 (1 << 10)                          /* PB10 Pull Up Control Bit */
#define PWR_PUCRB_PB11                 (1 << 11)                          /* PB11 Pull Up Control Bit */
#define PWR_PUCRB_PB12                 (1 << 12)                          /* PB12 Pull Up Control Bit */
#define PWR_PUCRB_PB13                 (1 << 13)                          /* PB13 Pull Up Control Bit */
#define PWR_PUCRB_PB14                 (1 << 14)                          /* PB14 Pull Up Control Bit */
#define PWR_PUCRB_PB15                 (1 << 15)                          /* PB15 Pull Up Control Bit */

/* Power Port B Pull Down Control Register (PDCRB) */

#define PWR_PDCRB_PB0                  (1 << 0)                           /* PB0 Pull Down Control Bit */
#define PWR_PDCRB_PB1                  (1 << 1)                           /* PB1 Pull Down Control Bit */
#define PWR_PDCRB_PB2                  (1 << 2)                           /* PB2 Pull Down Control Bit */
#define PWR_PDCRB_PB3                  (1 << 3)                           /* PB3 Pull Down Control Bit */
#define PWR_PDCRB_PB4                  (1 << 4)                           /* PB4 Pull Down Control Bit */
#define PWR_PDCRB_PB5                  (1 << 5)                           /* PB5 Pull Down Control Bit */
#define PWR_PDCRB_PB6                  (1 << 6)                           /* PB6 Pull Down Control Bit */
#define PWR_PDCRB_PB7                  (1 << 7)                           /* PB7 Pull Down Control Bit */
#define PWR_PDCRB_PB8                  (1 << 8)                           /* PB8 Pull Down Control Bit */
#define PWR_PDCRB_PB9                  (1 << 9)                           /* PB9 Pull Down Control Bit */
#define PWR_PDCRB_PB10                 (1 << 10)                          /* PB10 Pull Down Control Bit */
#define PWR_PDCRB_PB11                 (1 << 11)                          /* PB11 Pull Down Control Bit */
#define PWR_PDCRB_PB12                 (1 << 12)                          /* PB12 Pull Down Control Bit */
#define PWR_PDCRB_PB13                 (1 << 13)                          /* PB13 Pull Down Control Bit */
#define PWR_PDCRB_PB14                 (1 << 14)                          /* PB14 Pull Down Control Bit */
#define PWR_PDCRB_PB15                 (1 << 15)                          /* PB15 Pull Down Control Bit */

/* Power Port C Pull Up Control Register (PUCRC) */

#define PWR_PUCRC_PC0                  (1 << 0)                           /* PC0 Pull Up Control Bit */
#define PWR_PUCRC_PC1                  (1 << 1)                           /* PC1 Pull Up Control Bit */
#define PWR_PUCRC_PC2                  (1 << 2)                           /* PC2 Pull Up Control Bit */
#define PWR_PUCRC_PC3                  (1 << 3)                           /* PC3 Pull Up Control Bit */
#define PWR_PUCRC_PC4                  (1 << 4)                           /* PC4 Pull Up Control Bit */
#define PWR_PUCRC_PC5                  (1 << 5)                           /* PC5 Pull Up Control Bit */
#define PWR_PUCRC_PC6                  (1 << 6)                           /* PC6 Pull Up Control Bit */
#define PWR_PUCRC_PC7                  (1 << 7)                           /* PC7 Pull Up Control Bit */
#define PWR_PUCRC_PC8                  (1 << 8)                           /* PC8 Pull Up Control Bit */
#define PWR_PUCRC_PC9                  (1 << 9)                           /* PC9 Pull Up Control Bit */
#define PWR_PUCRC_PC10                 (1 << 10)                          /* PC10 Pull Up Control Bit */
#define PWR_PUCRC_PC11                 (1 << 11)                          /* PC11 Pull Up Control Bit */
#define PWR_PUCRC_PC12                 (1 << 12)                          /* PC12 Pull Up Control Bit */
#define PWR_PUCRC_PC13                 (1 << 13)                          /* PC13 Pull Up Control Bit */
#define PWR_PUCRC_PC14                 (1 << 14)                          /* PC14 Pull Up Control Bit */
#define PWR_PUCRC_PC15                 (1 << 15)                          /* PC15 Pull Up Control Bit */

