apache/nuttx/arch/arm/src/stm32g4/hardware/stm32g4xxxx_pwr.h
/* Power Port C Pull Down Control Register (PDCRC) */

#define PWR_PDCRC_PC0                  (1 << 0)                           /* PC0 Pull Down Control Bit */
#define PWR_PDCRC_PC1                  (1 << 1)                           /* PC1 Pull Down Control Bit */
#define PWR_PDCRC_PC2                  (1 << 2)                           /* PC2 Pull Down Control Bit */
#define PWR_PDCRC_PC3                  (1 << 3)                           /* PC3 Pull Down Control Bit */
#define PWR_PDCRC_PC4                  (1 << 4)                           /* PC4 Pull Down Control Bit */
#define PWR_PDCRC_PC5                  (1 << 5)                           /* PC5 Pull Down Control Bit */
#define PWR_PDCRC_PC6                  (1 << 6)                           /* PC6 Pull Down Control Bit */
#define PWR_PDCRC_PC7                  (1 << 7)                           /* PC7 Pull Down Control Bit */
#define PWR_PDCRC_PC8                  (1 << 8)                           /* PC8 Pull Down Control Bit */
#define PWR_PDCRC_PC9                  (1 << 9)                           /* PC9 Pull Down Control Bit */
#define PWR_PDCRC_PC10                 (1 << 10)                          /* PC10 Pull Down Control Bit */
#define PWR_PDCRC_PC11                 (1 << 11)                          /* PC11 Pull Down Control Bit */
#define PWR_PDCRC_PC12                 (1 << 12)                          /* PC12 Pull Down Control Bit */
#define PWR_PDCRC_PC13                 (1 << 13)                          /* PC13 Pull Down Control Bit */
#define PWR_PDCRC_PC14                 (1 << 14)                          /* PC14 Pull Down Control Bit */
#define PWR_PDCRC_PC15                 (1 << 15)                          /* PC15 Pull Down Control Bit */

/* Power Port D Pull Up Control Register (PUCRD) */

#define PWR_PUCRD_PD0                  (1 << 0)                           /* PD0 Pull Up Control Bit */
#define PWR_PUCRD_PD1                  (1 << 1)                           /* PD1 Pull Up Control Bit */
#define PWR_PUCRD_PD2                  (1 << 2)                           /* PD2 Pull Up Control Bit */
#define PWR_PUCRD_PD3                  (1 << 3)                           /* PD3 Pull Up Control Bit */
#define PWR_PUCRD_PD4                  (1 << 4)                           /* PD4 Pull Up Control Bit */
#define PWR_PUCRD_PD5                  (1 << 5)                           /* PD5 Pull Up Control Bit */
#define PWR_PUCRD_PD6                  (1 << 6)                           /* PD6 Pull Up Control Bit */
#define PWR_PUCRD_PD7                  (1 << 7)                           /* PD7 Pull Up Control Bit */
#define PWR_PUCRD_PD8                  (1 << 8)                           /* PD8 Pull Up Control Bit */
#define PWR_PUCRD_PD9                  (1 << 9)                           /* PD9 Pull Up Control Bit */
#define PWR_PUCRD_PD10                 (1 << 10)                          /* PD10 Pull Up Control Bit */
#define PWR_PUCRD_PD11                 (1 << 11)                          /* PD11 Pull Up Control Bit */
#define PWR_PUCRD_PD12                 (1 << 12)                          /* PD12 Pull Up Control Bit */
#define PWR_PUCRD_PD13                 (1 << 13)                          /* PD13 Pull Up Control Bit */
#define PWR_PUCRD_PD14                 (1 << 14)                          /* PD14 Pull Up Control Bit */
#define PWR_PUCRD_PD15                 (1 << 15)                          /* PD15 Pull Up Control Bit */

/* Power Port D Pull Down Control Register (PDCRD) */

#define PWR_PDCRD_PD0                  (1 << 0)                           /* PD0 Pull Down Control Bit */
#define PWR_PDCRD_PD1                  (1 << 1)                           /* PD1 Pull Down Control Bit */
#define PWR_PDCRD_PD2                  (1 << 2)                           /* PD2 Pull Down Control Bit */
#define PWR_PDCRD_PD3                  (1 << 3)                           /* PD3 Pull Down Control Bit */
#define PWR_PDCRD_PD4                  (1 << 4)                           /* PD4 Pull Down Control Bit */
#define PWR_PDCRD_PD5                  (1 << 5)                           /* PD5 Pull Down Control Bit */
#define PWR_PDCRD_PD6                  (1 << 6)                           /* PD6 Pull Down Control Bit */
#define PWR_PDCRD_PD7                  (1 << 7)                           /* PD7 Pull Down Control Bit */
#define PWR_PDCRD_PD8                  (1 << 8)                           /* PD8 Pull Down Control Bit */
#define PWR_PDCRD_PD9                  (1 << 9)                           /* PD9 Pull Down Control Bit */
#define PWR_PDCRD_PD10                 (1 << 10)                          /* PD10 Pull Down Control Bit */
#define PWR_PDCRD_PD11                 (1 << 11)                          /* PD11 Pull Down Control Bit */
#define PWR_PDCRD_PD12                 (1 << 12)                          /* PD12 Pull Down Control Bit */
#define PWR_PDCRD_PD13                 (1 << 13)                          /* PD13 Pull Down Control Bit */
#define PWR_PDCRD_PD14                 (1 << 14)                          /* PD14 Pull Down Control Bit */
#define PWR_PDCRD_PD15                 (1 << 15)                          /* PD15 Pull Down Control Bit */

/* Power Port E Pull Up Control Register (PUCRE) */

#define PWR_PUCRE_PE0                  (1 << 0)                           /* PE0 Pull Up Control Bit */
#define PWR_PUCRE_PE1                  (1 << 1)                           /* PE1 Pull Up Control Bit */
#define PWR_PUCRE_PE2                  (1 << 2)                           /* PE2 Pull Up Control Bit */
#define PWR_PUCRE_PE3                  (1 << 3)                           /* PE3 Pull Up Control Bit */
#define PWR_PUCRE_PE4                  (1 << 4)                           /* PE4 Pull Up Control Bit */
#define PWR_PUCRE_PE5                  (1 << 5)                           /* PE5 Pull Up Control Bit */
#define PWR_PUCRE_PE6                  (1 << 6)                           /* PE6 Pull Up Control Bit */
#define PWR_PUCRE_PE7                  (1 << 7)                           /* PE7 Pull Up Control Bit */
#define PWR_PUCRE_PE8                  (1 << 8)                           /* PE8 Pull Up Control Bit */
#define PWR_PUCRE_PE9                  (1 << 9)                           /* PE9 Pull Up Control Bit */
#define PWR_PUCRE_PE10                 (1 << 10)                          /* PE10 Pull Up Control Bit */
#define PWR_PUCRE_PE11                 (1 << 11)                          /* PE11 Pull Up Control Bit */
#define PWR_PUCRE_PE12                 (1 << 12)                          /* PE12 Pull Up Control Bit */
#define PWR_PUCRE_PE13                 (1 << 13)                          /* PE13 Pull Up Control Bit */
#define PWR_PUCRE_PE14                 (1 << 14)                          /* PE14 Pull Up Control Bit */
#define PWR_PUCRE_PE15                 (1 << 15)                          /* PE15 Pull Up Control Bit */

/* Power Port E Pull Down Control Register (PDCRE) */

#define PWR_PDCRE_PE0                  (1 << 0)                           /* PE0 Pull Down Control Bit */
#define PWR_PDCRE_PE1                  (1 << 1)                           /* PE1 Pull Down Control Bit */
#define PWR_PDCRE_PE2                  (1 << 2)                           /* PE2 Pull Down Control Bit */
#define PWR_PDCRE_PE3                  (1 << 3)                           /* PE3 Pull Down Control Bit */
#define PWR_PDCRE_PE4                  (1 << 4)                           /* PE4 Pull Down Control Bit */
#define PWR_PDCRE_PE5                  (1 << 5)                           /* PE5 Pull Down Control Bit */
#define PWR_PDCRE_PE6                  (1 << 6)                           /* PE6 Pull Down Control Bit */
#define PWR_PDCRE_PE7                  (1 << 7)                           /* PE7 Pull Down Control Bit */
#define PWR_PDCRE_PE8                  (1 << 8)                           /* PE8 Pull Down Control Bit */
#define PWR_PDCRE_PE9                  (1 << 9)                           /* PE9 Pull Down Control Bit */
#define PWR_PDCRE_PE10                 (1 << 10)                          /* PE10 Pull Down Control Bit */
#define PWR_PDCRE_PE11                 (1 << 11)                          /* PE11 Pull Down Control Bit */
#define PWR_PDCRE_PE12                 (1 << 12)                          /* PE12 Pull Down Control Bit */
#define PWR_PDCRE_PE13                 (1 << 13)                          /* PE13 Pull Down Control Bit */
#define PWR_PDCRE_PE14                 (1 << 14)                          /* PE14 Pull Down Control Bit */
#define PWR_PDCRE_PE15                 (1 << 15)                          /* PE15 Pull Down Control Bit */

/* Power Port F Pull Up Control Register (PUCRF) */

