apache/nuttx/arch/arm/src/stm32g4/hardware/stm32g4xxxx_pwr.h
#define PWR_PUCRF_PF0                  (1 << 0)                           /* PF0 Pull Up Control Bit */
#define PWR_PUCRF_PF1                  (1 << 1)                           /* PF1 Pull Up Control Bit */
#define PWR_PUCRF_PF2                  (1 << 2)                           /* PF2 Pull Up Control Bit */
#define PWR_PUCRF_PF3                  (1 << 3)                           /* PF3 Pull Up Control Bit */
#define PWR_PUCRF_PF4                  (1 << 4)                           /* PF4 Pull Up Control Bit */
#define PWR_PUCRF_PF5                  (1 << 5)                           /* PF5 Pull Up Control Bit */
#define PWR_PUCRF_PF6                  (1 << 6)                           /* PF6 Pull Up Control Bit */
#define PWR_PUCRF_PF7                  (1 << 7)                           /* PF7 Pull Up Control Bit */
#define PWR_PUCRF_PF8                  (1 << 8)                           /* PF8 Pull Up Control Bit */
#define PWR_PUCRF_PF9                  (1 << 9)                           /* PF9 Pull Up Control Bit */
#define PWR_PUCRF_PF10                 (1 << 10)                          /* PF10 Pull Up Control Bit */
#define PWR_PUCRF_PF11                 (1 << 11)                          /* PF11 Pull Up Control Bit */
#define PWR_PUCRF_PF12                 (1 << 12)                          /* PF12 Pull Up Control Bit */
#define PWR_PUCRF_PF13                 (1 << 13)                          /* PF13 Pull Up Control Bit */
#define PWR_PUCRF_PF14                 (1 << 14)                          /* PF14 Pull Up Control Bit */
#define PWR_PUCRF_PF15                 (1 << 15)                          /* PF15 Pull Up Control Bit */

/* Power Port F Pull Down Control Register (PDCRF) */

#define PWR_PDCRF_PF0                  (1 << 0)                           /* PF0 Pull Down Control Bit */
#define PWR_PDCRF_PF1                  (1 << 1)                           /* PF1 Pull Down Control Bit */
#define PWR_PDCRF_PF2                  (1 << 2)                           /* PF2 Pull Down Control Bit */
#define PWR_PDCRF_PF3                  (1 << 3)                           /* PF3 Pull Down Control Bit */
#define PWR_PDCRF_PF4                  (1 << 4)                           /* PF4 Pull Down Control Bit */
#define PWR_PDCRF_PF5                  (1 << 5)                           /* PF5 Pull Down Control Bit */
#define PWR_PDCRF_PF6                  (1 << 6)                           /* PF6 Pull Down Control Bit */
#define PWR_PDCRF_PF7                  (1 << 7)                           /* PF7 Pull Down Control Bit */
#define PWR_PDCRF_PF8                  (1 << 8)                           /* PF8 Pull Down Control Bit */
#define PWR_PDCRF_PF9                  (1 << 9)                           /* PF9 Pull Down Control Bit */
#define PWR_PDCRF_PF10                 (1 << 10)                          /* PF10 Pull Down Control Bit */
#define PWR_PDCRF_PF11                 (1 << 11)                          /* PF11 Pull Down Control Bit */
#define PWR_PDCRF_PF12                 (1 << 12)                          /* PF12 Pull Down Control Bit */
#define PWR_PDCRF_PF13                 (1 << 13)                          /* PF13 Pull Down Control Bit */
#define PWR_PDCRF_PF14                 (1 << 14)                          /* PF14 Pull Down Control Bit */
#define PWR_PDCRF_PF15                 (1 << 15)                          /* PF15 Pull Down Control Bit */

/* Power Port G Pull Up Control Register (PUCRG) */

#define PWR_PUCRG_PG0                  (1 << 0)                           /* PG0 Pull Up Control Bit */
#define PWR_PUCRG_PG1                  (1 << 1)                           /* PG1 Pull Up Control Bit */
#define PWR_PUCRG_PG2                  (1 << 2)                           /* PG2 Pull Up Control Bit */
#define PWR_PUCRG_PG3                  (1 << 3)                           /* PG3 Pull Up Control Bit */
#define PWR_PUCRG_PG4                  (1 << 4)                           /* PG4 Pull Up Control Bit */
#define PWR_PUCRG_PG5                  (1 << 5)                           /* PG5 Pull Up Control Bit */
#define PWR_PUCRG_PG6                  (1 << 6)                           /* PG6 Pull Up Control Bit */
#define PWR_PUCRG_PG7                  (1 << 7)                           /* PG7 Pull Up Control Bit */
#define PWR_PUCRG_PG8                  (1 << 8)                           /* PG8 Pull Up Control Bit */
#define PWR_PUCRG_PG9                  (1 << 9)                           /* PG9 Pull Up Control Bit */
#define PWR_PUCRG_PG10                 (1 << 10)                          /* PG10 Pull Up Control Bit */
#define PWR_PUCRG_PG11                 (1 << 11)                          /* PG11 Pull Up Control Bit */
#define PWR_PUCRG_PG12                 (1 << 12)                          /* PG12 Pull Up Control Bit */
#define PWR_PUCRG_PG13                 (1 << 13)                          /* PG13 Pull Up Control Bit */
#define PWR_PUCRG_PG14                 (1 << 14)                          /* PG14 Pull Up Control Bit */
#define PWR_PUCRG_PG15                 (1 << 15)                          /* PG15 Pull Up Control Bit */

/* Power Port G Pull Down Control Register (PDCRG) */

#define PWR_PDCRG_PG0                  (1 << 0)                           /* PG0 Pull Down Control Bit */
#define PWR_PDCRG_PG1                  (1 << 1)                           /* PG1 Pull Down Control Bit */
#define PWR_PDCRG_PG2                  (1 << 2)                           /* PG2 Pull Down Control Bit */
#define PWR_PDCRG_PG3                  (1 << 3)                           /* PG3 Pull Down Control Bit */
#define PWR_PDCRG_PG4                  (1 << 4)                           /* PG4 Pull Down Control Bit */
#define PWR_PDCRG_PG5                  (1 << 5)                           /* PG5 Pull Down Control Bit */
#define PWR_PDCRG_PG6                  (1 << 6)                           /* PG6 Pull Down Control Bit */
#define PWR_PDCRG_PG7                  (1 << 7)                           /* PG7 Pull Down Control Bit */
#define PWR_PDCRG_PG8                  (1 << 8)                           /* PG8 Pull Down Control Bit */
#define PWR_PDCRG_PG9                  (1 << 9)                           /* PG9 Pull Down Control Bit */
#define PWR_PDCRG_PG10                 (1 << 10)                          /* PG10 Pull Down Control Bit */
#define PWR_PDCRG_PG11                 (1 << 11)                          /* PG11 Pull Down Control Bit */
#define PWR_PDCRG_PG12                 (1 << 12)                          /* PG12 Pull Down Control Bit */
#define PWR_PDCRG_PG13                 (1 << 13)                          /* PG13 Pull Down Control Bit */
#define PWR_PDCRG_PG14                 (1 << 14)                          /* PG14 Pull Down Control Bit */
#define PWR_PDCRG_PG15                 (1 << 15)                          /* PG15 Pull Down Control Bit */

/* PWR power control register 5 (CR5) */

#define PWR_CR5_R1MODE_SHIFT           (8)
#define PWR_CR5_R1MODE                 (0x1 << PWR_CR5_R1MODE_SHIFT)      /* Main Regulator Range 1 Mode */

#endif /* __ARCH_ARM_SRC_STM32_HARDWARE_STM32G4XXXX_PWR_H */
